In [1]:
import pandas as pd
from sqlalchemy import create_engine
import datetime as dt

In [2]:
airline_file = "Data/airlines.csv"
airline_df = pd.read_csv(airline_file)
airline_df.head()

,Airline ID,Name,Alias,IATA,ICAO,Callsign,Country,Active
0,-1,Unknown,\N,-,NaN,\N,\N,Y
1,1,Private flight,\N,-,NaN,NaN,NaN,Y
2,2,135 Airways,\N,NaN,GNL,GENERAL,United States,N
3,3,1Time Airline,\N,1T,RNX,NEXTIME,South Africa,Y
4,4,2 Sqn No 1 Elementary Flying Training School,\N,NaN,WYT,NaN,United Kingdom,N

In [3]:
# Changing the names of columns and filtering columns we require
airline_clean_df = airline_df[["Airline ID", "Name", "ICAO", "Country", "Active"]].copy()
airline_clean_df = airline_clean_df.rename(columns = {"Name": "Operator"})
airline_clean_df

,Airline ID,Operator,ICAO,Country,Active
0,-1,Unknown,NaN,\N,Y
1,1,Private flight,NaN,NaN,Y
2,2,135 Airways,GNL,United States,N
3,3,1Time Airline,RNX,South Africa,Y
4,4,2 Sqn No 1 Elementary Flying Training School,WYT,United Kingdom,N
...,...,...,...,...,...
6157,21248,GX Airlines,CBG,China,Y
6158,21251,Lynx Aviation (L3/SSX),SSX,United States,N
6159,21268,Jetgo Australia,\N,Australia,Y
6160,21270,Air Carnival,\N,India,Y
6161,21317,Svyaz Rossiya,SJM,Russia,Y

In [4]:
# Changing the name of Airlines in the Airlines.csv
airline_clean_df = airline_clean_df.replace({'Aeroflot Russian Airlines': 'Aeroflot',
                                            'Avianca - Aerovias Nacionales de Colombia': 'Avianca',
                                            'Private flight': 'Private'})
airline_clean_df

,Airline ID,Operator,ICAO,Country,Active
0,-1,Unknown,NaN,\N,Y
1,1,Private,NaN,NaN,Y
2,2,135 Airways,GNL,United States,N
3,3,1Time Airline,RNX,South Africa,Y
4,4,2 Sqn No 1 Elementary Flying Training School,WYT,United Kingdom,N
...,...,...,...,...,...
6157,21248,GX Airlines,CBG,China,Y
6158,21251,Lynx Aviation (L3/SSX),SSX,United States,N
6159,21268,Jetgo Australia,\N,Australia,Y
6160,21270,Air Carnival,\N,India,Y
6161,21317,Svyaz Rossiya,SJM,Russia,Y

In [5]:
# Checking if the Operator names have been changed
airline_clean_df.loc[airline_clean_df['Operator'] == 'Avianca']

     Airline ID Operator ICAO  Country Active
515         515  Avianca  AVA  AVIANCA      Y

In [6]:
# Changing the names of Countries
airline_clean_df = airline_clean_df.replace({'ALASKA': 'United States',
                                                        'AVIANCA': 'Colombia',
                                                        'Russia]]': 'Russia'
                                                        })
airline_clean_df

,Airline ID,Operator,ICAO,Country,Active
0,-1,Unknown,NaN,\N,Y
1,1,Private,NaN,NaN,Y
2,2,135 Airways,GNL,United States,N
3,3,1Time Airline,RNX,South Africa,Y
4,4,2 Sqn No 1 Elementary Flying Training School,WYT,United Kingdom,N
...,...,...,...,...,...
6157,21248,GX Airlines,CBG,China,Y
6158,21251,Lynx Aviation (L3/SSX),SSX,United States,N
6159,21268,Jetgo Australia,\N,Australia,Y
6160,21270,Air Carnival,\N,India,Y
6161,21317,Svyaz Rossiya,SJM,Russia,Y

In [7]:
# Checking to see if the Country names have been changed
airline_clean_df.loc[airline_clean_df['Country'] == 'ALASKA']

Empty DataFrame
Columns: [Airline ID, Operator, ICAO, Country, Active]
Index: []

In [8]:
# # Resetin the index for airline_clean_df
# airline_clean_df = airline_clean_df.reset_index()
# # airline_clean_df = airline_df[["Airline ID", "Name", "Country", "Active"]]
# airline_clean_df

In [9]:
airline_clean_df.loc[airline_clean_df['Operator'] == 'Aeroflot']

     Airline ID  Operator ICAO Country Active
130         130  Aeroflot  AFL  Russia      Y

In [10]:
# airline_clean_df['Operator'].drop_duplicates()

In [11]:
# airline_clean_df['Operator'].value_counts().head(50)

In [12]:
crash_file = "Data/Airplane_Crashes_and_Fatalities_Since_1908.csv"
crash_df = pd.read_csv(crash_file)
crash_df.head()

,Date,Time,Location,Operator,Flight #,Route,Type,Registration,cn/In,Aboard,Fatalities,Ground,Summary
0,09/17/1908,17:18,"Fort Myer, Virginia",Military - U.S. Army,NaN,Demonstration,Wright Flyer III,NaN,1,2.0,1.0,0.0,"During a demonstration flight, a U.S. Army fly..."
1,7/12/1912,6:30,"AtlantiCity, New Jersey",Military - U.S. Navy,NaN,Test flight,Dirigible,NaN,NaN,5.0,5.0,0.0,First U.S. dirigible Akron exploded just offsh...
2,8/06/1913,NaN,"Victoria, British Columbia, Canada",Private,-,NaN,Curtiss seaplane,NaN,NaN,1.0,1.0,0.0,The first fatal airplane accident in Canada oc...
3,9/09/1913,18:30,Over the North Sea,Military - German Navy,NaN,NaN,Zeppelin L-1 (airship),NaN,NaN,20.0,14.0,0.0,The airship flew into a thunderstorm and encou...
4,10/17/1913,10:30,"Near Johannisthal, Germany",Military - German Navy,NaN,NaN,Zeppelin L-2 (airship),NaN,NaN,30.0,30.0,0.0,Hydrogen gas which was being vented was sucked...

In [13]:
crash_clean_df = crash_df[["Date", "Location", "Operator", "Type", "Aboard", "Fatalities", "Summary"]].copy()
crash_clean_df["Date"] = pd.to_datetime(crash_clean_df["Date"])
crash_clean_df = crash_clean_df[crash_clean_df["Date"].dt.year >= 1970]

crash_clean_df = crash_clean_df.reset_index()

In [14]:
# # All the crashes with two or more collisions, still trying a way to separating the two operators
# crash_clean_df[crash_clean_df['Operator'].str.contains('/', na=False)]

In [15]:
# Attempting the resolve how to split the two collision rows
# crash_clean_df['Operator', 'Type'] = crash_clean_df['Operator', 'Type'].str.split("/") 
# crash_clean_df.explode('Operator', 'Type').reset_index(drop=False)

In [16]:
crash_clean_df.head()

,index,Date,Location,Operator,Type,Aboard,Fatalities,Summary
0,1237,1970-02-13,"Pin-la-Garenne, France",Avia-Taxi,Cessna 402,10.0,10.0,NaN
1,1643,1973-05-11,"Near Semipalatinsk, USSR",Aeroflot,Ilyushin IL-18B,61.0,61.0,NaN
2,1807,1973-10-12,"Acapulco, Mexico",Avionas Banamex,de Havilland DH-125-1A,8.0,8.0,Crashed while approaching to land.
3,1965,1973-10-15,"Fort Smith AFB, Oklahoma",Military - U.S. Air Force,Lockheed C-130E Hercules,7.0,7.0,Crashed into a mountain.
4,2003,1975-07-31,"Santiago, Chili",Military - Chilian Air Force,Douglas C-47,10.0,10.0,NaN

In [17]:
# crash_clean_df.iloc[80:100]

In [18]:
# Renaming Airlines so they match with the two datasets
crash_clean_df = crash_clean_df.replace({'United Air lines': 'United Airlines',
                                         'AVIANCA': 'Avianca',
                                         'Varig': ' Varig Log',
                                         'Compania Dominicana de Aviacion': 'Dominicana de Aviaci',
                                         'Aviogenex (Yugoslavia)': 'Aviogenex',
                                         'Stirling Airways': 'Stirling Airlines',
                                         'Japan Air Lines': 'Japan Airlines',
                                         'Cathay PacifiAirways': 'Cathay Pacific',
                                         'British European Airways': 'British Airways',
                                         'Spantax': 'Spantax S.A.',
                                         'Eastern Air Lines': 'Balitmore Airways',
                                         'Alia Royal Jordanian Airlines': ' Royal Jordanian',
                                         'Libya Arab Airlines': ' Libyan Airlines',
                                         'Turkish Airlines(THY)': 'Turkish Airlines',
                                         'Martinair Holland NV': 'Martinair',
                                         'Ceskoslevenske Aerolinie': 'Czech Airlines',
                                         'Inex Adria Aviopromet': 'Adria Airways',
                                         'TAP (Air Portugal)': 'TAP Portugal',
                                         'Air India': 'Air India Limited',
                                         'Loftledidir IcelandiAirlines': 'Icelandair',
                                         'Iran National Airlines': 'Iran Air',
                                         'Dan Air Services': 'Dan-Air London',
                                         'Korean Airlines': ' Korean Air',
                                         'Arrow Airways': 'Arrow Air',
                                         'Mexicana': 'Mexicana de Aviaci',
                                         'Thai Airways': 'Thai Airways International',
                                         'Tajikistan Airlines': 'Tajikistan International Airlines',
                                         'Cebu PacifiAir': ' Cebu Pacific',
                                         'China Airlines (Taiwan)': 'China Airlines',
                                         'EgyptAir': 'Egyptair',
                                         'Scandinavian Airlines (SAS)': 'Scandinavian Airlines System',
                                         'Flash Air': 'Flash Airlines',
                                         'Subir (S7)': 'S7 Airlines',
                                         'Pulkovo Airlines': 'Rossiya-Russian Airlines',
                                         'TAM (Brazil)': 'TAM Brazilian Airlines',
                                         'One-Two-Go Airlines': 'One Two Go Airlines',
                                         'Philippine Air Lines': 'Philippine Airlines',
                                         'Garuda Indonesia Airlines': 'Garuda Indonesia'})

In [19]:
# Dropping the index column
crash_clean_df = crash_clean_df.drop(columns=['index'])
crash_clean_df

,Date,Location,Operator,Type,Aboard,Fatalities,Summary
0,1970-02-13,"Pin-la-Garenne, France",Avia-Taxi,Cessna 402,10.0,10.0,NaN
1,1973-05-11,"Near Semipalatinsk, USSR",Aeroflot,Ilyushin IL-18B,61.0,61.0,NaN
2,1973-10-12,"Acapulco, Mexico",Avionas Banamex,de Havilland DH-125-1A,8.0,8.0,Crashed while approaching to land.
3,1973-10-15,"Fort Smith AFB, Oklahoma",Military - U.S. Air Force,Lockheed C-130E Hercules,7.0,7.0,Crashed into a mountain.
4,1975-07-31,"Santiago, Chili",Military - Chilian Air Force,Douglas C-47,10.0,10.0,NaN
...,...,...,...,...,...,...,...
2907,2009-05-20,"Near Madiun, Indonesia",Military - Indonesian Air Force,Lockheed C-130 Hercules,112.0,98.0,"While on approach, the military transport cras..."
2908,2009-05-26,"Near Isiro, DemocratiRepubliCongo",Service Air,Antonov An-26,4.0,4.0,The cargo plane crashed while on approach to I...
2909,2009-06-01,"AtlantiOcean, 570 miles northeast of Natal, Br...",Air France,Airbus A330-203,228.0,228.0,The Airbus went missing over the AtlantiOcean ...
2910,2009-06-07,"Near Port Hope Simpson, Newfoundland, Canada",Strait Air,Britten-Norman BN-2A-27 Islander,1.0,1.0,The air ambulance crashed into hills while att...
2911,2009-06-08,"State of Arunachal Pradesh, India",Military - Indian Air Force,Antonov An-32,13.0,13.0,The military transport went missing while en r...

In [20]:
# Merging the two tables together
airline_crash_df = pd.merge(airline_clean_df, crash_clean_df, how='inner', on='Operator')
airline_crash_df

,Airline ID,Operator,ICAO,Country,Active,Date,Location,Type,Aboard,Fatalities,Summary
0,1,Private,NaN,NaN,Y,1970-10-04,"Mahaffey, Pennsylvania",Aero Commander 500-B,2.0,2.0,The aircraft crashed into a mountainside 20 mi...
1,1,Private,NaN,NaN,Y,1971-05-28,"Roanoke, Virginia",Aero Commander 680E,6.0,6.0,The flight crashed into the side of a mountain...
2,1,Private,NaN,NaN,Y,1972-09-24,"Sacramento, California",F-86 Sabrejet,1.0,0.0,A World War II vintage Sabrejet fighter leavin...
3,1,Private,NaN,NaN,Y,1972-10-16,Off the Alaska coast,Cessna 310C,4.0,4.0,The plane was on a flight from Anchorage to Ju...
4,1,Private,NaN,NaN,Y,1973-08-15,"Don Don, Haiti",Norman BN-2A-6,10.0,10.0,Airframe failure in flight.
...,...,...,...,...,...,...,...,...,...,...,...
921,18140,Spantax S.A.,BXS,Spain,N,1972-09-30,"Madrid, Spain",Douglas C-47B,6.0,1.0,"The student pilot rotated too quickly, the pla..."
922,18140,Spantax S.A.,BXS,Spain,N,1972-12-03,"Tenerife, Canary Islands",Convair CV-990-30A-5 Coronado,155.0,155.0,Reached a height of 300 feet when the plane s...
923,18140,Spantax S.A.,BXS,Spain,N,1980-08-13,"Sa Cabaneta, Spain",Learjet 35A,4.0,4.0,Slamed into a mountain while on approach.
924,18140,Spantax S.A.,BXS,Spain,N,1982-09-13,"Near Malaga, Spain",McDonnell Douglas DC-10-30CF,394.0,50.0,The aircraft crashed during takeoff after inte...
925,18762,Lina Congo,\N,Congo (Brazzaville),N,1992-03-12,"Etsouali, Congo",de Havilland Canada DHC-6 Twin Otter 300,8.0,3.0,Crashed during a severe thunderstorm.

In [21]:
# Test to see Airline values are entered 
airline_crash_df[airline_crash_df['Operator'] == 'Japan Airlines']

,Airline ID,Operator,ICAO,Country,Active,Date,Location,Type,Aboard,Fatalities,Summary
574,2987,Japan Airlines,JAL,Japan,Y,1972-06-14,"Near New Delhi, India",McDonnell Douglas DC-8-53,87.0,82.0,The aircraft crashed short of the runway. Indi...
575,2987,Japan Airlines,JAL,Japan,Y,1972-11-28,"Near Moscow, Russia",McDonnell Douglas DC-8-62,76.0,62.0,The aircraft lost altitude while taking off an...
576,2987,Japan Airlines,JAL,Japan,Y,1977-01-13,"Anchorage, Alaska",Douglas DC-8,5.0,5.0,The cargo plane crashed while attempting to ta...
577,2987,Japan Airlines,JAL,Japan,Y,1977-09-27,"Kuala Lumpur, Malaysia",McDonnell Douglas DC-8-62H,79.0,34.0,The aircraft struck a hill 4 miles short of th...
578,2987,Japan Airlines,JAL,Japan,Y,1982-02-09,"Tokyo, Japan",McDonnell Douglas DC-8-61,174.0,24.0,"The aircraft flew into shallow water, 100 yard..."
579,2987,Japan Airlines,JAL,Japan,Y,1985-08-12,"Mt. Osutaka, near Ueno Village, Japan",Boeing B-747-SR46,524.0,520.0,The aircraft suffered an aft pressure bulkhead...
580,2987,Japan Airlines,JAL,Japan,Y,1993-03-31,"Anchorage, Alaska",Boeing B-747-466,5.0,0.0,The No.2 engine and pylon separated from the a...

In [22]:
airline_crash_df[airline_crash_df['Country'] == 'Australia']

,Airline ID,Operator,ICAO,Country,Active,Date,Location,Type,Aboard,Fatalities,Summary
52,120,Alliance Airlines,UTY,Australia,Y,1998-07-30,"Kochi, India",Dornier 228-201,6.0,6.0,"Shortly after taking off the plane pitched up,..."
543,2695,Heavylift Cargo Airlines,HVY,Australia,N,1994-09-23,"Kowloon Bay, Hong Kong",Lockheed L-100-30 Hercules,12.0,6.0,The cargo plane lost control shortly after bec...
901,5438,Whyalla Airlines,WWL,Australia,N,2000-05-31,"Off Whyalla, Australia",Piper PA-31-350 Navajo,8.0,8.0,"En route and descending at Whyalla, at 6,000 ..."

In [23]:
# Number of crashes per Operator Country
airline_crash_df["Country"].value_counts().head(50)

United States       148
Russia              146
France               52
Indonesia            50
United Kingdom       28
Canada               27
Colombia             24
Taiwan               21
China                17
Philippines          17
India                16
Brazil               15
Sudan                14
Spain                13
Egypt                12
Ecuador              10
Japan                10
Nigeria              10
Papua New Guinea      9
Romania               9
Ethiopia              9
South Africa          9
Angola                9
Thailand              8
Pakistan              8
Uganda                7
Nepal                 7
Afghanistan           7
Venezuela             6
Italy                 6
Mexico                6
Poland                5
Sweden                5
Malaysia              5
Iran                  4
Algeria               4
Portugal              4
Cameroon              4
Guatemala             4
Argentina             4
Kenya                 4
Azerbaijan            3
Australia             3
Tajikistan            3
Austria               3
Guyana                3
Morocco               3
Switzerland           3
Netherlands           3
Sierra Leone          3
Name: Country, dtype: int64

In [24]:
# Number of active operators
airline_crash_df["Active"].value_counts()

Y    565
N    361
Name: Active, dtype: int64

In [25]:
# Operators with the most crashes
airline_crash_df["Operator"].value_counts().head(50)

Aeroflot                           141
Air Taxi                            41
Private                             25
Merpati Nusantara Airlines          16
Philippine Airlines                 14
Indian Airlines                     13
Pan American World Airways          12
British Airways                     12
China Airlines                      12
Garuda Indonesia                    11
National Airlines                   10
American Airlines                   10
SATENA                              10
Tarom                                9
Egyptair                             9
Ethiopian Airlines                   9
Balkan Bulgarian Airlines            9
Air France                           8
Pakistan International Airlines      8
Japan Airlines                       7
TAME                                 7
Talair                               7
Trans World Airlines                 7
VASP                                 7
Avianca                              7
Air Express                          6
Eagle Air                            6
Comair                               6
Delta Air Lines                      6
Thai Airways International           6
Ariana Afghan Airlines               6
Sudan Airways                        5
Spantax S.A.                         5
Royal Nepal Airlines                 5
Formosa Airlines                     5
TAAG Angola Airlines                 5
LOT Polish Airlines                  5
Pelita Air Service                   5
TAM Brazilian Airlines               5
Iran Air                             4
Aviateca                             4
Eagle Aviation                       4
Bali International Air Service       4
Dan-Air London                       4
Airlink                              4
China Eastern Airlines               4
Continental Airlines                 4
Cameroon Airlines                    4
Ameriflight                          4
Air Canada                           4
Name: Operator, dtype: int64